tiborsimon/embedded-tdd-headers/pic/8bit/pic16f1718_tdd.h
#define T1GPPS                        1091
#define CCP1PPS                       1092
#define CCP2PPS                       1093
#define COGINPPS                      1094
#define SSPCLKPPS                     1095
#define SSPDATPPS                     1096
#define SSPSSPPS                      1097
#define RXPPS                         1098
#define CKPPS                         1099
#define CLCIN0PPS                     1100
#define CLCIN1PPS                     1101
#define CLCIN2PPS                     1102
#define CLCIN3PPS                     1103
#define RA0PPS                        1104
#define RA1PPS                        1105
#define RA2PPS                        1106
#define RA3PPS                        1107
#define RA4PPS                        1108
#define RA5PPS                        1109
#define RA6PPS                        1110
#define RA7PPS                        1111
#define RB0PPS                        1112
#define RB1PPS                        1113
#define RB2PPS                        1114
#define RB3PPS                        1115
#define RB4PPS                        1116
#define RB5PPS                        1117
#define RB6PPS                        1118
#define RB7PPS                        1119
#define RC0PPS                        1120
#define RC1PPS                        1121
#define RC2PPS                        1122
#define RC3PPS                        1123
#define RC4PPS                        1124
#define RC5PPS                        1125
#define RC6PPS                        1126
#define RC7PPS                        1127
#define CLCDATA                       1128
#define MCLC1OUT                      1129
#define MLC1OUT                       1130
#define MCLC2OUT                      1131
#define MLC2OUT                       1132
#define MLC3OUT                       1133
#define MCLC3OUT                      1134
#define MLC4OUT                       1135
#define MCLC4OUT                      1136
#define CLC1CON                       1137
#define CLC1CON_MODE                  1138
#define LC1MODE0                      1139
#define LC1MODE                       1140
#define CLC1CON_MODE0                 1141
#define LC1MODE1                      1142
#define CLC1CON_MODE1                 1143
#define CLC1CON_MODE2                 1144
#define LC1MODE2                      1145
#define LC1INTN                       1146
#define CLC1CON_INTN                  1147
#define LC1INTP                       1148
#define CLC1CON_INTP                  1149
#define CLC1CON_OUT                   1150
#define LC1OUT                        1151
#define LC1EN                         1152
#define CLC1CON_EN                    1153
#define CLC1POL                       1154
#define LC1G1POL                      1155
#define CLC1POL_G1POL                 1156
#define CLC1POL_G2POL                 1157
#define LC1G2POL                      1158
#define LC1G3POL                      1159
#define CLC1POL_G3POL                 1160
#define LC1G4POL                      1161
#define CLC1POL_G4POL                 1162
#define CLC1POL_POL                   1163
#define LC1POL                        1164
#define CLC1SEL0                      1165
#define CLC1SEL0_D1S0                 1166
#define LC1D1S                        1167
#define LC1D1S0                       1168
#define CLC1SEL0_D1S                  1169
#define CLC1SEL0_D1S1                 1170
#define LC1D1S1                       1171
#define CLC1SEL0_D1S2                 1172
#define LC1D1S2                       1173
#define CLC1SEL0_D1S3                 1174
#define LC1D1S3                       1175
#define CLC1SEL0_D1S4                 1176
#define LC1D1S4                       1177
#define CLC1SEL1                      1178
#define CLC1SEL1_D2S0                 1179
#define CLC1SEL1_D2S                  1180
#define LC1D2S                        1181
#define LC1D2S0                       1182
#define CLC1SEL1_D2S1                 1183
#define LC1D2S1                       1184
#define LC1D2S2                       1185
#define CLC1SEL1_D2S2                 1186
#define LC1D2S3                       1187
#define CLC1SEL1_D2S3                 1188
#define LC1D2S4                       1189
#define CLC1SEL1_D2S4                 1190
#define CLC1SEL2                      1191
#define LC1D3S0                       1192
#define CLC1SEL2_D3S                  1193
#define LC1D3S                        1194
#define CLC1SEL2_D3S0                 1195
#define LC1D3S1                       1196
#define CLC1SEL2_D3S1                 1197
#define LC1D3S2                       1198
#define CLC1SEL2_D3S2                 1199
#define LC1D3S3                       1200
#define CLC1SEL2_D3S3                 1201
#define LC1D3S4                       1202
#define CLC1SEL2_D3S4                 1203
#define CLC1SEL3                      1204
#define CLC1SEL3_D4S                  1205
#define LC1D4S                        1206
#define LC1D4S0                       1207
#define CLC1SEL3_D4S0                 1208
#define CLC1SEL3_D4S1                 1209
#define LC1D4S1                       1210
#define LC1D4S2                       1211
#define CLC1SEL3_D4S2                 1212
#define LC1D4S3                       1213
#define CLC1SEL3_D4S3                 1214
#define LC1D4S4                       1215
#define CLC1SEL3_D4S4                 1216
#define CLC1GLS0                      1217
#define CLC1GLS0_D1N                  1218
#define LC1G1D1N                      1219
#define CLC1GLS0_D1T                  1220
#define LC1G1D1T                      1221
#define LC1G1D2N                      1222
#define CLC1GLS0_D2N                  1223
#define LC1G1D2T                      1224
#define CLC1GLS0_D2T                  1225
#define CLC1GLS0_D3N                  1226
#define LC1G1D3N                      1227
#define CLC1GLS0_D3T                  1228
#define LC1G1D3T                      1229
#define CLC1GLS0_D4N                  1230
#define LC1G1D4N                      1231
#define CLC1GLS0_D4T                  1232
#define LC1G1D4T                      1233
#define CLC1GLS1                      1234
#define CLC1GLS1_D1N                  1235
#define LC1G2D1N                      1236
#define LC1G2D1T                      1237
#define CLC1GLS1_D1T                  1238
#define CLC1GLS1_D2N                  1239
#define LC1G2D2N                      1240
#define LC1G2D2T                      1241
#define CLC1GLS1_D2T                  1242
#define CLC1GLS1_D3N                  1243
#define LC1G2D3N                      1244
#define LC1G2D3T                      1245
#define CLC1GLS1_D3T                  1246
#define CLC1GLS1_D4N                  1247
#define LC1G2D4N                      1248
#define LC1G2D4T                      1249
#define CLC1GLS1_D4T                  1250
#define CLC1GLS2                      1251
#define CLC1GLS2_D1N                  1252
#define LC1G3D1N                      1253
#define LC1G3D1T                      1254
#define CLC1GLS2_D1T                  1255
#define LC1G3D2N                      1256
#define CLC1GLS2_D2N                  1257
#define LC1G3D2T                      1258
#define CLC1GLS2_D2T                  1259
#define CLC1GLS2_D3N                  1260
#define LC1G3D3N                      1261
#define LC1G3D3T                      1262
#define CLC1GLS2_D3T                  1263
#define LC1G3D4N                      1264
#define CLC1GLS2_D4N                  1265
#define LC1G3D4T                      1266
#define CLC1GLS2_D4T                  1267
#define CLC1GLS3                      1268
#define LC1G4D1N                      1269
#define CLC1GLS3_G4D1N                1270
#define LC1G4D1T                      1271
#define CLC1GLS3_G4D1T                1272
#define CLC1GLS3_G4D2N                1273
#define LC1G4D2N                      1274
#define CLC1GLS3_G4D2T                1275
#define LC1G4D2T                      1276
#define LC1G4D3N                      1277
#define CLC1GLS3_G4D3N                1278
#define LC1G4D3T                      1279
#define CLC1GLS3_G4D3T                1280
#define CLC1GLS3_G4D4N                1281
#define LC1G4D4N                      1282
#define CLC1GLS3_G4D4T                1283
#define LC1G4D4T                      1284
#define CLC2CON                       1285
#define LC2MODE0                      1286
#define CLC2CON_MODE                  1287
#define LC2MODE                       1288
#define CLC2CON_MODE0                 1289
#define LC2MODE1                      1290
#define CLC2CON_MODE1                 1291
#define LC2MODE2                      1292
#define CLC2CON_MODE2                 1293
#define LC2INTN                       1294
#define CLC2CON_INTN                  1295
#define LC2INTP                       1296
#define CLC2CON_INTP                  1297
#define CLC2CON_OUT                   1298
#define LC2OUT                        1299
#define CLC2CON_EN                    1300
#define LC2EN                         1301
#define CLC2POL                       1302
#define LC2G1POL                      1303
#define CLC2POL_G1POL                 1304
#define LC2G2POL                      1305
#define CLC2POL_G2POL                 1306
#define LC2G3POL                      1307
#define CLC2POL_G3POL                 1308
#define LC2G4POL                      1309
#define CLC2POL_G4POL                 1310
#define CLC2POL_POL                   1311
#define LC2POL                        1312
#define CLC2SEL0                      1313
#define CLC2SEL0_D1S                  1314
#define LC2D1S0                       1315
#define CLC2SEL0_D1S0                 1316
#define LC2D1S                        1317
#define LC2D1S1                       1318
#define CLC2SEL0_D1S1                 1319
#define LC2D1S2                       1320
#define CLC2SEL0_D1S2                 1321
#define CLC2SEL0_D1S3                 1322
#define LC2D1S3                       1323
#define LC2D1S4                       1324
#define CLC2SEL0_D1S4                 1325
#define CLC2SEL1                      1326
#define LC2D2S0                       1327
#define CLC2SEL1_D2S0                 1328
#define LC2D2S                        1329
#define CLC2SEL1_D2S                  1330
#define LC2D2S1                       1331
#define CLC2SEL1_D2S1                 1332
#define LC2D2S2                       1333
#define CLC2SEL1_D2S2                 1334
#define LC2D2S3                       1335
#define CLC2SEL1_D2S3                 1336
#define LC2D2S4                       1337
#define CLC2SEL1_D2S4                 1338
#define CLC2SEL2                      1339
#define CLC2SEL2_D3S                  1340
#define LC2D3S0                       1341
#define CLC2SEL2_D3S0                 1342
#define LC2D3S                        1343
#define CLC2SEL2_D3S1                 1344
#define LC2D3S1                       1345
#define LC2D3S2                       1346
#define CLC2SEL2_D3S2                 1347
#define LC2D3S3                       1348
#define CLC2SEL2_D3S3                 1349
#define LC2D3S4                       1350
#define CLC2SEL2_D3S4                 1351
#define CLC2SEL3                      1352
#define LC2D4S                        1353
#define LC2D4S0                       1354
#define CLC2SEL3_D4S                  1355
#define CLC2SEL3_D4S0                 1356
#define LC2D4S1                       1357
#define CLC2SEL3_D4S1                 1358
#define LC2D4S2                       1359
#define CLC2SEL3_D4S2                 1360
#define CLC2SEL3_D4S3                 1361
#define LC2D4S3                       1362
#define LC2D4S4                       1363
#define CLC2SEL3_D4S4                 1364
#define CLC2GLS0                      1365
#define LC2G1D1N                      1366
#define CLC2GLS0_D1N                  1367
#define CLC2GLS0_D1T                  1368
#define LC2G1D1T                      1369
#define LC2G1D2N                      1370
#define CLC2GLS0_D2N                  1371
#define CLC2GLS0_D2T                  1372
#define LC2G1D2T                      1373
#define LC2G1D3N                      1374
#define CLC2GLS0_D3N                  1375
#define CLC2GLS0_D3T                  1376
#define LC2G1D3T                      1377
#define LC2G1D4N                      1378
#define CLC2GLS0_D4N                  1379
#define CLC2GLS0_D4T                  1380
#define LC2G1D4T                      1381
#define CLC2GLS1                      1382
#define CLC2GLS1_D1N                  1383
#define LC2G2D1N                      1384
#define CLC2GLS1_D1T                  1385
#define LC2G2D1T                      1386
#define CLC2GLS1_D2N                  1387
#define LC2G2D2N                      1388
#define CLC2GLS1_D2T                  1389
#define LC2G2D2T                      1390
#define LC2G2D3N                      1391
#define CLC2GLS1_D3N                  1392
#define LC2G2D3T                      1393
#define CLC2GLS1_D3T                  1394
#define LC2G2D4N                      1395
#define CLC2GLS1_D4N                  1396
#define LC2G2D4T                      1397
#define CLC2GLS1_D4T                  1398
#define CLC2GLS2                      1399
#define LC2G3D1N                      1400
#define CLC2GLS2_D1N                  1401
#define CLC2GLS2_D1T                  1402
#define LC2G3D1T                      1403
#define CLC2GLS2_D2N                  1404
#define LC2G3D2N                      1405
#define LC2G3D2T                      1406
#define CLC2GLS2_D2T                  1407
#define CLC2GLS2_D3N                  1408
#define LC2G3D3N                      1409
#define CLC2GLS2_D3T                  1410
#define LC2G3D3T                      1411
#define CLC2GLS2_D4N                  1412
#define LC2G3D4N                      1413
#define LC2G3D4T                      1414
#define CLC2GLS2_D4T                  1415
#define CLC2GLS3                      1416
#define LC2G4D1N                      1417
#define CLC2GLS3_G4D1N                1418
#define CLC2GLS3_G4D1T                1419
#define LC2G4D1T                      1420
#define CLC2GLS3_G4D2N                1421
#define LC2G4D2N                      1422
#define LC2G4D2T                      1423
#define CLC2GLS3_G4D2T                1424
#define CLC2GLS3_G4D3N                1425
#define LC2G4D3N                      1426
#define CLC2GLS3_G4D3T                1427
#define LC2G4D3T                      1428
#define LC2G4D4N                      1429
#define CLC2GLS3_G4D4N                1430
#define CLC2GLS3_G4D4T                1431
#define LC2G4D4T                      1432
#define CLC3CON                       1433
#define LC3MODE0                      1434
#define CLC3CON_MODE0                 1435
#define CLC3CON_MODE                  1436
#define LC3MODE                       1437
#define LC3MODE1                      1438
#define CLC3CON_MODE1                 1439
#define LC3MODE2                      1440
#define CLC3CON_MODE2                 1441
#define LC3INTN                       1442
#define CLC3CON_INTN                  1443
#define CLC3CON_INTP                  1444
#define LC3INTP                       1445
#define CLC3CON_OUT                   1446
#define LC3OUT                        1447
#define LC3EN                         1448
#define CLC3CON_EN                    1449
#define CLC3POL                       1450
#define LC3G1POL                      1451
#define CLC3POL_G1POL                 1452
#define LC3G2POL                      1453
#define CLC3POL_G2POL                 1454
#define CLC3POL_G3POL                 1455
#define LC3G3POL                      1456
#define LC3G4POL                      1457
#define CLC3POL_G4POL                 1458
#define LC3POL                        1459
#define CLC3POL_POL                   1460
#define CLC3SEL0                      1461
#define CLC3SEL0_D1S0                 1462
#define LC3D1S0                       1463
#define LC3D1S                        1464
#define CLC3SEL0_D1S                  1465
#define LC3D1S1                       1466
#define CLC3SEL0_D1S1                 1467
#define LC3D1S2                       1468
#define CLC3SEL0_D1S2                 1469
#define LC3D1S3                       1470
#define CLC3SEL0_D1S3                 1471
#define LC3D1S4                       1472
#define CLC3SEL0_D1S4                 1473
#define CLC3SEL1                      1474
#define CLC3SEL1_D2S                  1475
#define CLC3SEL1_D2S0                 1476
#define LC3D2S                        1477
#define LC3D2S0                       1478
#define CLC3SEL1_D2S1                 1479
#define LC3D2S1                       1480
#define CLC3SEL1_D2S2                 1481
#define LC3D2S2                       1482
#define CLC3SEL1_D2S3                 1483
#define LC3D2S3                       1484
#define LC3D2S4                       1485
#define CLC3SEL1_D2S4                 1486
#define CLC3SEL2                      1487
#define CLC3SEL2_D3S0                 1488
#define LC3D3S                        1489
#define CLC3SEL2_D3S                  1490
#define LC3D3S0                       1491
#define LC3D3S1                       1492
#define CLC3SEL2_D3S1                 1493
#define LC3D3S2                       1494
#define CLC3SEL2_D3S2                 1495
#define LC3D3S3                       1496
#define CLC3SEL2_D3S3                 1497
#define LC3D3S4                       1498
#define CLC3SEL2_D3S4                 1499
#define CLC3SEL3                      1500
#define CLC3SEL3_D4S0                 1501
#define LC3D4S0                       1502
#define LC3D4S                        1503
#define CLC3SEL3_D4S                  1504
#define LC3D4S1                       1505
#define CLC3SEL3_D4S1                 1506
#define LC3D4S2                       1507
#define CLC3SEL3_D4S2                 1508
#define LC3D4S3                       1509
#define CLC3SEL3_D4S3                 1510
#define LC3D4S4                       1511
#define CLC3SEL3_D4S4                 1512
#define CLC3GLS0                      1513
#define CLC3GLS0_D1N                  1514
#define LC3G1D1N                      1515
#define LC3G1D1T                      1516
#define CLC3GLS0_D1T                  1517
#define LC3G1D2N                      1518
#define CLC3GLS0_D2N                  1519
#define CLC3GLS0_D2T                  1520
#define LC3G1D2T                      1521
#define CLC3GLS0_D3N                  1522
#define LC3G1D3N                      1523
#define LC3G1D3T                      1524
#define CLC3GLS0_D3T                  1525
#define CLC3GLS0_D4N                  1526
#define LC3G1D4N                      1527
#define CLC3GLS0_D4T                  1528
#define LC3G1D4T                      1529
#define CLC3GLS1                      1530
#define LC3G2D1N                      1531
#define CLC3GLS1_D1N                  1532
#define CLC3GLS1_D1T                  1533
#define LC3G2D1T                      1534
#define LC3G2D2N                      1535
#define CLC3GLS1_D2N                  1536
#define LC3G2D2T                      1537
#define CLC3GLS1_D2T                  1538
#define LC3G2D3N                      1539
#define CLC3GLS1_D3N                  1540
#define CLC3GLS1_D3T                  1541
#define LC3G2D3T                      1542
#define LC3G2D4N                      1543
#define CLC3GLS1_D4N                  1544
#define LC3G2D4T                      1545
#define CLC3GLS1_D4T                  1546
#define CLC3GLS2                      1547
#define LC3G3D1N                      1548
#define CLC3GLS2_D1N                  1549
#define LC3G3D1T                      1550
#define CLC3GLS2_D1T                  1551
#define CLC3GLS2_D2N                  1552
#define LC3G3D2N                      1553
#define CLC3GLS2_D2T                  1554
#define LC3G3D2T                      1555
#define CLC3GLS2_D3N                  1556
#define LC3G3D3N                      1557
#define LC3G3D3T                      1558
#define CLC3GLS2_D3T                  1559
#define CLC3GLS2_D4N                  1560
#define LC3G3D4N                      1561
#define CLC3GLS2_D4T                  1562
#define LC3G3D4T                      1563
#define CLC3GLS3                      1564
#define LC3G4D1N                      1565
#define CLC3GLS3_G4D1N                1566
#define LC3G4D1T                      1567
#define CLC3GLS3_G4D1T                1568
#define LC3G4D2N                      1569
#define CLC3GLS3_G4D2N                1570
#define CLC3GLS3_G4D2T                1571
#define LC3G4D2T                      1572
#define LC3G4D3N                      1573
#define CLC3GLS3_G4D3N                1574
#define CLC3GLS3_G4D3T                1575
#define LC3G4D3T                      1576
#define LC3G4D4N                      1577
#define CLC3GLS3_G4D4N                1578
#define LC3G4D4T                      1579
#define CLC3GLS3_G4D4T                1580
#define CLC4CON                       1581
#define LC4MODE                       1582
#define CLC4CON_MODE                  1583
#define LC4MODE0                      1584
#define CLC4CON_MODE0                 1585
#define LC4MODE1                      1586
#define CLC4CON_MODE1                 1587
#define LC4MODE2                      1588
#define CLC4CON_MODE2                 1589
#define LC4INTN                       1590
#define CLC4CON_INTN                  1591
#define CLC4CON_INTP                  1592
#define LC4INTP                       1593
#define CLC4CON_OUT                   1594
#define LC4OUT                        1595
#define CLC4CON_EN                    1596
#define LC4EN                         1597
#define CLC4POL                       1598
#define CLC4POL_G1POL                 1599
#define LC4G1POL                      1600
#define CLC4POL_G2POL                 1601
#define LC4G2POL                      1602
#define CLC4POL_G3POL                 1603
#define LC4G3POL                      1604
#define LC4G4POL                      1605
#define CLC4POL_G4POL                 1606
#define LC4POL                        1607
#define CLC4POL_POL                   1608
#define CLC4SEL0                      1609
#define CLC4SEL0_D1S0                 1610
#define LC4D1S0                       1611
#define CLC4SEL0_D1S                  1612
#define LC4D1S                        1613
#define CLC4SEL0_D1S1                 1614
#define LC4D1S1                       1615
#define CLC4SEL0_D1S2                 1616
#define LC4D1S2                       1617
#define CLC4SEL0_D1S3                 1618
#define LC4D1S3                       1619
#define CLC4SEL0_D1S4                 1620
#define LC4D1S4                       1621
#define CLC4SEL1                      1622
#define LC4D2S                        1623
#define LC4D2S0                       1624
#define CLC4SEL1_D2S                  1625
#define CLC4SEL1_D2S0                 1626
#define LC4D2S1                       1627
#define CLC4SEL1_D2S1                 1628
#define LC4D2S2                       1629
#define CLC4SEL1_D2S2                 1630
#define LC4D2S3                       1631
#define CLC4SEL1_D2S3                 1632
#define LC4D2S4                       1633
#define CLC4SEL1_D2S4                 1634
#define CLC4SEL2                      1635
#define LC4D3S                        1636
#define CLC4SEL2_D3S                  1637
#define CLC4SEL2_D3S0                 1638
#define LC4D3S0                       1639
#define LC4D3S1                       1640
#define CLC4SEL2_D3S1                 1641
#define CLC4SEL2_D3S2                 1642
#define LC4D3S2                       1643
#define CLC4SEL2_D3S3                 1644
#define LC4D3S3                       1645
#define LC4D3S4                       1646
#define CLC4SEL2_D3S4                 1647
#define CLC4SEL3                      1648
